tubeTests/caseGPU/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver            AmgX;
        mode              dDDI;
        dataLocation      device;

        AmgXconfigPath       "~/OpenFOAM/ubuntu-v2412/run/openFoamTests/natConvBox/caseGPU/system/configs/PCG_DILU.json";
    }


    "(U|Ux|Uy|Uz|k|epsilon)"
    {
        solver            AmgX;
        mode              dDDI;
        dataLocation      device;

        AmgXconfigPath       "~/OpenFOAM/ubuntu-v2412/run/openFoamTests/natConvBox/caseGPU/system/configs/PBICGSTAB_CLASSICAL_JACOBI.json";
    }

    cellDisplacement
    {
        $p;
        relTol          0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;

    residualControl
    {
        p               1e-4;
        "(U|Ux|Uy|Uz)"             1e-6;
        "(k|epsilon|omega)" 1e-6;
    }
}

relaxationFactors
{
    fields { p           0.7;
    }
    equations { "(U|Ux|Uy|Uz)"               0.65;
        "(k|epsilon)"   0.7;
    }
}

// ************************************************************************* //
